_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 3, 224, 224)]     0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 64, 224, 224)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 64, 224, 224)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 64, 112, 112)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 128, 112, 112)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 128, 112, 112)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 128, 56, 56)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 256, 56, 56)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 256, 56, 56)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 256, 56, 56)       590080    
_________________________________________________________________
block3_conv4 (Conv2D)        (None, 256, 56, 56)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 256, 28, 28)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 512, 28, 28)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 512, 28, 28)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 512, 28, 28)       2359808   
_________________________________________________________________
block4_conv4 (Conv2D)        (None, 512, 28, 28)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 512, 14, 14)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 512, 14, 14)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 512, 14, 14)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 512, 14, 14)       2359808   
_________________________________________________________________
block5_conv4 (Conv2D)        (None, 512, 14, 14)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 512, 7, 7)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
fc1 (Dense)                  (None, 4096)              102764544 
_________________________________________________________________
fc2 (Dense)                  (None, 1024)              4195328   
_________________________________________________________________
predictions (Dense)          (None, 1)                 1025      